In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    'key1': ['a', 'a', 'b', 'b', 'a'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': np.random.randn(5),
    'data2': np.random.randn(5)
})
df

      data1     data2 key1 key2
0 -0.339259 -2.230265    a  one
1  0.706782 -1.378455    a  two
2  1.086667 -1.651998    b  one
3 -0.883818 -0.496979    b  two
4  0.993352  0.553432    a  one

In [4]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [5]:
grouped.groups

{'a': Int64Index([0, 1, 4], dtype='int64'),
 'b': Int64Index([2, 3], dtype='int64')}

In [6]:
grouped.mean()

key1
a    0.453625
b    0.101425
Name: data1, dtype: float64

In [8]:
from IPython.display import display
for name, group in grouped:
    print ('Name:', name)
    display(group)

Name: a

0   -0.339259
1    0.706782
4    0.993352
Name: data1, dtype: float64

Name: b

2    1.086667
3   -0.883818
Name: data1, dtype: float64

In [10]:
g2 = df['data1'].groupby([df['key1'], df['key2']])
g2.groups

{('a', 'one'): Int64Index([0, 4], dtype='int64'),
 ('a', 'two'): Int64Index([1], dtype='int64'),
 ('b', 'one'): Int64Index([2], dtype='int64'),
 ('b', 'two'): Int64Index([3], dtype='int64')}

In [11]:
df

      data1     data2 key1 key2
0 -0.339259 -2.230265    a  one
1  0.706782 -1.378455    a  two
2  1.086667 -1.651998    b  one
3 -0.883818 -0.496979    b  two
4  0.993352  0.553432    a  one

In [12]:
g2.mean()

key1  key2
a     one     0.327046
      two     0.706782
b     one     1.086667
      two    -0.883818
Name: data1, dtype: float64

In [14]:
klg = df.groupby('key1')
klg

In [15]:
klg.groups

{'a': Int64Index([0, 1, 4], dtype='int64'),
 'b': Int64Index([2, 3], dtype='int64')}

In [16]:
klg.mean()

         data1     data2
key1
a     0.453625 -1.018429
b     0.101425 -1.074488

In [17]:
for n, g in klg:
    print ('name:', n)
    display(g)

name: a

      data1     data2 key1 key2
0 -0.339259 -2.230265    a  one
1  0.706782 -1.378455    a  two
4  0.993352  0.553432    a  one

name: b

      data1     data2 key1 key2
2  1.086667 -1.651998    b  one
3 -0.883818 -0.496979    b  two

In [18]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object